# Pandas Tutorial
 Python is open sourse python library that provides high performance.
 ###### Agenda
1. What id Data Frames
 2. what is Data Series
 3. Different operation in Pandas

In [93]:
import numpy as np
import pandas as pd

In [122]:
# playing with dataframe

df = pd.DataFrame(np.arange(0,20).reshape(4,5),index=['row1','row2','row3','row4'], columns=['col1','col2','col3','col4','col5'])

In [131]:
df.head()

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
row2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19

###### To convert any dataframe into csv file

In [106]:
df.to_csv('Test.csv')

##### Accessing the element in the dataframe
 1. .loc  2. .iloc

In [116]:
# .loc  if we are retreiving only one row

df.loc['row1']

col1    0
col2    1
col3    2
col4    3
col5    4
Name: row1, dtype: int32

In [156]:
df[['col1', 'col2']]

      col1  col2
row1     0     1
row2     5     6
row3    10    11
row4    15    16

In [115]:
# type
type(df.loc['row1'])

pandas.core.series.Series

In [134]:
# .iloc if we have more than one row to retreive then use .iloc

df.iloc[0:3,0:2]

      col1  col2
row1     0     1
row2     5     6
row3    10    11

In [136]:
# check the type

type(df.iloc[0:3,0:2])

pandas.core.frame.DataFrame

In [140]:
# convert dataframe into array

df1=df.iloc[:,:].values
df1
# values convert into array

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [141]:
df1.shape

(4, 5)

In [145]:
#how to check the null values present in the rows and columns 

#df.isnull()
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
col5    0
dtype: int64

In [153]:
# how to find out how many unique catagery we have or not repeted any time
df['col1'].value_counts()

# to print the unique value
df['col1'].unique()

array([ 0,  5, 10, 15])

## Reading of .csv files

In [167]:
df = pd.read_csv("Test.csv")
# df = pd.read_csv("Test.csv", sap = ";")
# df.head()
# df.info()
# df.describe

In [170]:
# get the unique category count
df['col1'].value_counts()

0     1
10    1
5     1
15    1
Name: col1, dtype: int64

In [175]:
# will display that contain values greater than n
df[df['col3'] > 10]

  Unnamed: 0  col1  col2  col3  col4  col5
2       row3    10    11    12    13    14
3       row4    15    16    17    18    19